{
    "JSP;2022-03-28 17:58:18": [
        "JSP",
        "US",
        "Do not recommend. Go to a real vet",
        "I am a new first time Dutch customer,  and I am already not liking their services that they offer. YOU NEED A CONTACT NUMBER!! If I have a problem or question why do I need to send an email and WAIT AROUND for the simple question as to where is my pups meds that were prescribed during the zoom.  Not to mention my order wasn't placed for 2 days! 2 DAYS after my zoom consultant then the order was placed, I am about 5 days later with NO SHIPPING INFORMATION. Don't get me started on how much OVER PRICED I was charged.  That same medication was over 50% less in an actual veterinarian clinic. RIDICULOUSLY PRICEDI. DO. NOT. RECOMMEND. GET A PHOOOOOONE NUUUUMBER.That's all.",
        "2022-03-28 17:58:18"
    ],
    "Christina White;2022-03-28 15:16:02": [
        "Christina White",
        "GB",
        "THANK YOU",
        "VERY GOOD SERVICE",
        "2022-03-28 15:16:02"
    ],
    "Mike Stangle;2022-03-22 21:54:43": [
        "Mike Stangle",
        "US",
        "Would recommend Dutch for anyone who…",
        "Would recommend Dutch for anyone who loves their pup. They are capable, responsive, professional and knowledgeable especially when I need to take care of my A #1 priority (my dog)! Keep it up, Dutch",
        "2022-03-22 21:54:43"
    ],
    "Kelly Froelich;2022-03-19 22:59:16": [
        "Kelly Froelich",
        "US",
        "Loved the peace of mind",
        "Loved the peace of mind, calmness, and expertise - in addition to the convenience of a call from home - in understanding how we could help our pup Mac with his motion sickness. The vet was so knowledgeable and empathetic, taking the time to provide more education and lay out our options. Would 10/10 recommend!",
        "2022-03-19 22:59:16"
    ],
    "XxEvilGenius08xX;2022-03-18 05:59:52": [
        "XxEvilGenius08xX",
        "US",
        "This is a scam",
        "This is a scam, a simple Shopify website that takes your money. There are no vets that attempted to contact me or attend the zoom meeting that was sent to me. It's back to Charge back city for this scam of the day.They seem to like to respond publicly but still no response to inquiry as why they do not show up for their zoom invites yesterday. Just because you hire some $1/hr bot to post replies does not make you a legitimate company. Spend the money and build a real app if you are real lol",
        "2022-03-18 05:59:52"
    ],
    "Samantha Lieberman;2022-03-10 20:21:43": [
        "Samantha Lieberman",
        "US",
        "What a gem of a service!",
        "What a gem of a service! My dog was recently neutered and the area around the surgery started to get puffy and I became worried. I wouldn't have been able to see my regular vet anytime soon and I came upon the Dutch service. I spoke with Dr. Oluwafemi (not sure if that spelling is right) - he was so wonderful. I spent probably 20 minutes with him going through a thorough medical history review and then using my video and photos to show him the affected area. He eliminated several of my concerns that I found (erroneously) through Dr. Google (LOL). In all, amazing find. I got an OTC to help and I wish more people knew about this service.",
        "2022-03-10 20:21:43"
    ],
    "F. A;2022-03-10 03:08:45": [
        "F. A",
        "US",
        "SO HELPFUL! Got exactly what I needed. Thank you!",
        "Dutch provided me with SUCH A GREAT SUPPORT for my dog. My dog really struggles with travel anxiety to the point that it makes him so sick. The vet I spoke with was so responsive, helpful, understanding and kind. I got the medication in a timely manner and it has helped my dog so much. Thank you Dutch! I really needed this company and had such a great experience. Will be a repeat customer.",
        "2022-03-10 03:08:45"
    ],
    "Will Yang;2022-03-09 22:56:25": [
        "Will Yang",
        "US",
        "Time and Life Sever!",
        "This saved me so much time! and they helped my cat with her eye infection. was able to get her meds, now she's a happy kitty.",
        "2022-03-09 22:56:25"
    ],
    "Debra S Kent;2022-03-09 18:06:44": [
        "Debra S Kent",
        "US",
        "Good idea, horrible execution",
        "The vet took all of two minutes with me, clearly rushed. Worse, the company (after I paid them $180) had no record of my subscription. The vet asked ME to straighten it out; I said, since YOU work for Dutch, shouldn't you be the one to make contact? I can't even find a flippin' phone number for this company! I requested a refund immediately and have yet to hear from them. Learn from my mistake.",
        "2022-03-09 18:06:44"
    ],
    "Liz;2022-03-09 16:04:27": [
        "Liz",
        "US",
        "We had a great experience with Dutch",
        "We had a great experience with Dutch! The vet was super helpful and able to diagnose an eye infection. we got her meds and she was good after that! definitely returning to Dutch next time something happens (knock on wood)",
        "2022-03-09 16:04:27"
    ],
    "Alex;2022-03-08 17:03:07": [
        "Alex",
        "US",
        "Terrible company",
        "Terrible company. I explained i needed my cats prescription renewed in the appointment reason section. The vet connected with me, video chatting while driving a car, for 2 minutes to tell me they cant do cat prescriptions. I asked why they couldnt just tell me that and cancel the appointment instead of wasting my time. They refunded me and cancelled my subscription. I have two seperate emails confirming they cancelled. Well a month later they charged me again. This is an scam to try to get people to forget they have a subscription and charge monthly. They commit fraud when they say that your subscription is cancelled but still charge. you can also only cancel through email and there is no way to remove your payment method on the website. i have had to report the fraud to my credit card. do not use!!I sent 3 emails to dutch (responding to the feb 7 confirmation that my subscription was cancelled) telling them to refund my money and remove my information from their website. Instead of responding, they marked my trustpilot review as illegal. Charging a credit card you are not authorized to charge = fraud. Its clear they try hard to scrub negative reviews online.",
        "2022-03-08 17:03:07"
    ],
    "Paul E Meyer;2022-03-03 02:49:30": [
        "Paul E Meyer",
        "US",
        "This is basically fraudulent - though if they were up front they'd just not get any business",
        "This is basically fraudulent. They claim to be a vet service, but only after you sign up, pay money and authorize automatic renewal, and go to schedule an appointment do they tell you that they aren't licensed and can't do anything but give advice.They give the excuse that they aren't legally able to do what they advertise except in \"some states\" but they don't tell you anything about that until you have given them money.To their credit, when I complained they did refund the membership fee. But I lost almost 3 days responding to my cat's veterinary needs because of their misleading advertisement followed by their only telling me their actual capabilities after I'd asked for what I needed - real veterinary care.The moral of this story: Just because you see an ad when you search for \"mobile veterinary service\" in your area, you have no guarantee that you are getting what you searched for. Look for an actual DVM who actually does house calls.",
        "2022-03-03 02:49:30"
    ],
    "Tyler R;2022-02-23 18:35:36": [
        "Tyler R",
        "US",
        "A Waste Of My Money",
        "After seeing the good reviews I figured I’d give it a shot. My dog has been dealing with some skin issues and I was really looking forward to her being prescribed a strong topical or oral prescription. I’d made a point to tell the vet I have tried NUMEROUS otc items with no success. The vet said that they would prescribe some stuff after the call and I’d see it in my profile and then I approve or deny the items. Ok, great! Well things turned out not so great. I take a look after the call and see that every item they prescribed is otc. Not only that but the vet threw in items to treat tear stains when I never mentioned my dog having them (she never has) and the prices were ridiculous. Every item listed I could get a better product off Amazon for the same price, half the price, and even a third of the price! I also learned that the shipping process is not quick. But Amazon? I can get those items next day. Even Chewy would be quicker. Honestly, I would like to rate two stars but I’m not sure if I just had bad luck with the one vet I saw so I don’t want to speak for others and say this service is a complete waste. There may be vets that actually listen and are helpful. Sadly, I did not get one of them.",
        "2022-02-23 18:35:36"
    ],
    "Melissa Straits;2022-02-17 18:02:47": [
        "Melissa Straits",
        "US",
        "We love our Dutch doctor",
        "We love our Dutch doctor. We have always had quick response and help with our K-9 issues. They are great!",
        "2022-02-17 18:02:47"
    ],
    "Morgan;2022-02-17 00:35:43": [
        "Morgan",
        "US",
        "The calm is real!",
        "My dog has always struggled with anxiety since I got him as a 1 year old. He’s the sweetest boy but is terrified of strangers and other dogs. Since dealing with Dutch and their amazing vets, he’s on a regimen that works amazing! He’s calm in the car and while guests are over and you can see the stress just melt off of him. Highly recommend Dutch!",
        "2022-02-17 00:35:43"
    ],
    "Kristin;2022-01-27 11:03:31": [
        "Kristin",
        "US",
        "Vet never showed up",
        "I had an appointment at 430 am. The vet never showed up. No phone call. No email. No text. I waited on the meeting for 30 minutes and nothing",
        "2022-01-27 11:03:31"
    ],
    "Matt;2022-01-26 19:12:44": [
        "Matt",
        "US",
        "No more surprise vet bills",
        "Was great to be able to quickly chat with a vet about Oliver.  Saved me from a huge unnecessary vet bill and I do not have to worry about stressing him out going to the vet.  Happy I found this new service",
        "2022-01-26 19:12:44"
    ],
    "CARLA SINGLETON ;2022-01-22 20:24:12": [
        "CARLA SINGLETON ",
        "US",
        "I signed up for Dutch because my dog…",
        "I signed up for Dutch because my dog was having an issue and the er vets are 20 miles away (it was Saturday morning 0430) I signed up, paid and then was told I could not speak with a doc until 1130 that morning. I ended up driving there and paying $173, now Dutch won't refund my $19 because no refunds. I didn't use the service.",
        "2022-01-22 20:24:12"
    ],
    "cc;2022-01-19 16:38:17": [
        "cc",
        "US",
        "Waste of time. Beware",
        "Waste of time. Beware.  I signed up to use the service during the pandemic.  I tried to do the health assessment multiple times but link was broken.  Website routed me to pick an appointment time; at that appointment, vet told me he was not in my state and could not treat.  He said he would reroute me to another vet and noted that multiple clients have been put on his schedule that he could not treat due to wrong state scheduling problem.  It took several days of me following up with Dutch for customer service to finally fix a system wide  \"bug\" in the health assessment and I was then told to reschedule.  I filled out form, rescheduled and got a message from the next vet I scheduled with telling me I was again not in their state and to please reschedule again with a vet in my state.  Their scheduling system doesn't give the option to pick a vet by state (like Vetster does).  I asked on customer service how I can schedule to a vet in my state and received an automated response saying \"vets have reviewed your records and cannot treat your dog\".  I am still awaiting my $19 refund.  Very poorly run, stole my $19, no helpful communication from customer service.  Now using Vetster which is well run, gives you a vet in your state during scheduling, and none of this run around.  AVOID!!!-------------In response to the company's response below that my dog was not a good candidate to treat... The first vet from the wrong state I was scheduled with said my dog was a perfect candidate that can be treated with minor adjustment of medications, and he would pass me along to another vet in my state who would easily be able to adjust medications.  After again being scheduled with the wrong vet, I sent customer service my feedback that their platform doesn't work and then received their \"decline to treat email\".  frustrating experience.",
        "2022-01-19 16:38:17"
    ],
    "N Chambers;2022-01-11 19:48:31": [
        "N Chambers",
        "US",
        "A waste of time and money",
        "Though the dr was professional and friendly. I was told to take my dog to a therapist. I chose Dutch because I thought they could help with my dog's severe anxiety and from reading reviews. What is seemed like to me was they charge you $19 for a video consult just to make money.",
        "2022-01-11 19:48:31"
    ],
    "Kristen Orr;2021-12-24 18:16:38": [
        "Kristen Orr",
        "US",
        "100% recommend Dutch",
        "100% recommend Dutch! Dutch has completely transformed my dog. I receive quick responses when I need to check in with the vet and the medication is shipped timely. Dutch also sent a Christmas BarkBox for my pup. They really care about their customers (both people and animals). Awesome company!!!!",
        "2021-12-24 18:16:38"
    ],
    "Robin;2021-12-23 17:06:59": [
        "Robin",
        "US",
        "So happy with the service!",
        "I had a brief problem with my prescription, and Ryan in customer service spent days moving heaven and earth trying to fix things for me. I am so happy with the service, and so grateful! Also my kitty is feeling great.",
        "2021-12-23 17:06:59"
    ],
    "Samantha Brady;2021-12-22 22:55:57": [
        "Samantha Brady",
        "US",
        "I’ve been working with Ryan in…",
        "I’ve been working with Ryan in resolving a address concern and he’s been more than helpful with everything! I’ve received my packages as expected and everything went smoothly.",
        "2021-12-22 22:55:57"
    ],
    "Ximena Soto;2021-12-16 22:04:18": [
        "Ximena Soto",
        "US",
        "They took care of my issue in a fast…",
        "They took care of my issue in a fast and professional manner.",
        "2021-12-16 22:04:18"
    ],
    "Grayson;2021-11-25 19:27:39": [
        "Grayson",
        "US",
        "Works great!",
        "Works great! We use it for our cat who was attacking our other cats, but using this we can all live together",
        "2021-11-25 19:27:39"
    ],
    "Erika;2021-11-18 21:55:14": [
        "Erika",
        "US",
        "Dutch definitely cares",
        "This is amazing they care about your animals they are they to help you with what ever you need the price is great. I recommend this to all my animal owners and have a lot of friends that use this site. Thank you Dutch for all you do. They send your packages so neat and professional.",
        "2021-11-18 21:55:14"
    ],
    "Elijah Harris;2021-11-18 01:27:36": [
        "Elijah Harris",
        "US",
        "Fine Folks At Dutch",
        "Just wanted to say Ryan and the Doctors at Dutch are wonderful folks to deal with every time I have had an issue with anything they have taken care of it.",
        "2021-11-18 01:27:36"
    ],
    "Dave Stangle;2021-11-10 17:49:19": [
        "Dave Stangle",
        "US",
        "Love it! Excellent solution to an age old problem.",
        "What took the pet industry so long to come up with this? My dog has a skin infection on his belly. My vet said they couldn't see him until next week. I logged onto Dutch, spoke with a vet right away, and they already have antibiotics and a shampoo on the way. The Dutch Vet also stuck around to answer some questions about what might be causing the infection. This is a fantastic service and I'll be happy to continue to be a member.",
        "2021-11-10 17:49:19"
    ],
    "Tamara Manley;2021-11-05 07:29:03": [
        "Tamara Manley",
        "US",
        "Great experience and plan to take care…",
        "Great experience and plan to take care of my pet's anxiety.",
        "2021-11-05 07:29:03"
    ],
    "Daphne;2021-11-05 03:50:49": [
        "Daphne",
        "US",
        "Vet interaction…",
        "Was happy to find a vet online for my cats anxiety. And to get the prescription to help her. It’s been a month the vet hasn’t got ahold of me to see how she is doing. I sent in email telling vet how she was acting after a month. Vet still after 2 days didn’t get back to me. They sent me some email about what symptoms to look for. I wanted to hear from vet what she thought about my cat. Do they think she needs higher dose and maybe more pills. For now I’ll keep giving her the pills they sent me.",
        "2021-11-05 03:50:49"
    ],
    "Anxiety meds;2021-11-04 20:45:47": [
        "Anxiety meds",
        "US",
        "You did not ship out the medicine…",
        "You did not ship out the medicine (fluoxetine) in time, even after I contacted customer support.  We have a two day gap in meds. This is unacceptable for chronic anxiety meds.",
        "2021-11-04 20:45:47"
    ],
    "Abduleziz;2021-11-02 22:07:59": [
        "Abduleziz",
        "ET",
        "It is good for all veterinarians.",
        "",
        "2021-11-02 22:07:59"
    ],
    "Jonathan Szpakowski;2021-11-02 16:49:50": [
        "Jonathan Szpakowski",
        "US",
        "Process of getting the prescription was…",
        "Process of getting the prescription was easy and the meds are working great. However I received the first 30 day supply on October 1st and started the meds that day. 2nd 30 day supply didn’t arrive until nov 1st. Since October has 31 days we were out of medication for 2 days with a medication that isn’t supposed to stopped abruptly. Disappointed, everything should be shipped several days earlier.",
        "2021-11-02 16:49:50"
    ],
    "Autumn;2021-10-30 02:30:48": [
        "Autumn",
        "US",
        "Great customer service",
        "Great customer service Easy..quick..most importantly it works!",
        "2021-10-30 02:30:48"
    ],
    "Tyler;2021-10-29 02:24:00": [
        "Tyler",
        "US",
        "Efficient and knowledgeable",
        "Very knowledgeable. They get right back to you. My cat is doing a lot better thank you",
        "2021-10-29 02:24:00"
    ]
}